org/_thoughts/2020-09-23-making-sense-of-sense-makingV2.org
#+BEGIN_EXPORT html
---
layout: default
title: an org convert
---
#+END_EXPORT

* Making Sense of Sense-Making
:PROPERTIES:
:CUSTOM_ID:       f06991dc-cc77-4b1b-b7bb-403159a60d23
:END:

September, 2020

---

How intelligent systems learn rich representations that exploit
structure in the world to solve adaptive challenges is the major
question of intelligence. How and why does intelligence emerge in
complex adaptive systems? How can we build systems endowed with similar
representational infrastructure for understanding the world and acting
well in it?

Here I begin building an intuitive perspective for understanding how
adaptive systems gain meaningful knowledge of the world which supports
intelligent behavior. My interest is in the emergence of meaning that
leads to intelligent behaviors for adaptive systems, in contrast to a
survey of the specific cognitive mechanisms supporting human
intelligence. I want to develop some tools for thinking about the
evolutionary learning process that developed such complex systems as the
human mind. Below I aim to motivate the importance of the subjective and
action-oriented nature of natural intelligence for understanding the
search and learning process (evolution) that produced general
intelligence on Earth.

---

* TOC                                                                   :TOC:
- [[Making Sense of Sense-Making][Making Sense of Sense-Making]]
- [[1. Adaptive systems are subjective and action-oriented][1. Adaptive systems are subjective and action-oriented]]
    - [[1.1. intelligence is about exploiting emergent structure][1.1. intelligence is about exploiting emergent structure]]
    - [[1.2. roadmap][1.2. roadmap]]
- [[2. The appearance of a world][2. The appearance of a world]]
    - [[2.1. cognitive architecture defines subjective frame][2.1. cognitive architecture defines subjective frame]]
    - [[2.2. phenomenal contingencies][2.2. phenomenal contingencies]]
    - [[2.3. meaning emerges within subjective world structure][2.3. meaning emerges within subjective world structure]]
- [[3. Umwelt][3. Umwelt]]
    - [[3.1. the subjective perspective of living systems is crucial][3.1. the subjective perspective of living systems is crucial]]
    - [[3.3. subjective and action-oriented sense-making][3.3. subjective and action-oriented sense-making]]
- [[4. Exploiting structure][4. Exploiting structure]]
    - [[4.1. using world knowledge to do work][4.1. using world knowledge to do work]]
    - [[4.2. biology exploits physics and creates complexity][4.2. biology exploits physics and creates complexity]]
    - [[4.3. adaptive transitions in information processing][4.3. adaptive transitions in information processing]]
    - [[4.4. adaptations exploit accessible structure][4.4. adaptations exploit accessible structure]]
- [[5. Affordances][5. Affordances]]
    - [[5.1. perceiving possibilities][5.1. perceiving possibilities]]
    - [[5.2. expanding the concept of affordances][5.2. expanding the concept of affordances]]
    - [[5.3. exploring evolutionary affordances][5.3. exploring evolutionary affordances]]
    - [[5.4. situated action-oriented agents][5.4. situated action-oriented agents]]
- [[6. Adaptive world models][6. Adaptive world models]]
    - [[6.1. converging adaptive representational concepts][6.1. converging adaptive representational concepts]]
    - [[6.2. life without objects?][6.2. life without objects?]]
    - [[6.3. representational scaffolding][6.3. representational scaffolding]]
- [[7. Wrapping up][7. Wrapping up]]

** 1. Adaptive systems are subjective and action-oriented
   :PROPERTIES:
   :ID:       d2dde72d-166b-4a3e-b89c-f064d9c1bd66
   :CUSTOM_ID: 7df31510-0f49-4af6-b1d9-eac9dc11d5f9
   :END:
Thinking about how and why intelligence emerges forces us to be in touch
with the sole existence proof of general intelligence provided to us by
nature. This proof reveals to us that natural intelligence is about
processing information about the world to guide adaptive behavior. This
simple framing has important consequences. Studying natural intelligence
puts subjectivity and action-in-the-world center stage and demands we
try and piece together the conditions within which new forms of
sense-making emerge. Living systems have a point of view on the world,
and evolution learned to represent such phenomena as chemical gradients,
intuitive physics, and social dynamics for the purpose of producing
adaptive behavior to support this point of view. How?

*** 1.1. intelligence is about exploiting emergent structure
    :PROPERTIES:
    :ID:       0e6514fa-be10-4c21-87d9-0fdd6fdde82b
    :CUSTOM_ID: 70e4f2de-b2c8-4eaa-86f0-6b931f4475af
    :END:
In the big picture what I'm interested in is a story which describes the
evolution of intelligence through transitions in information processing
and cycles of creating and exploiting emergent structure in the world;
the richer and more abstract the information about the world a cognitive
system is able to exploit, the wider its ability to impact the world and
solve complex problems. I perceive this project of describing the
relationship between living systems and emergent structure as filling in
the space between physics and phenomenology. The story of intelligence.
This is a grandiose picture, but my weakness for philosophy and big
picture conceptual framings mandates I define the project as such.

*** 1.2. roadmap
    :PROPERTIES:
    :ID:       2a7641d4-22d5-4ff5-acb3-c16bb7a68167
    :CUSTOM_ID: 70171a53-1287-4799-a889-6f1fda70caa9
    :END:
Below I begin contextualizing how natural intelligence is fundamentally
situated in the world and the product of subjective sense-making
evolution developed in service of guiding adaptive behavior. In the
first section I begin to frame the problem of intelligence from the
subjective perspective and illuminate how cognitive systems are
subjective world models. In the second section I introduce Jakob von
Uexküll's Umwelt theory to further illustrate the subjective perspective
of living systems. In the third section I explicate what it means for
cognitive systems to "exploit structure in the world". In the fourth
section I introduce James Gibson's theory of affordances as a
theoretical concept to help conceptualize subjectively perceived
structure and the reciprocity defining the relationship between
cognitive systems and the world. In the fifth section I discuss the
representational scaffolding and flexibility underlying human
intelligence. At the end I will briefly review the discussion and
restate the subjective nature of the world models built by evolution and
their adaptive purpose.

