org/_thoughts/2020-09-23-making-sense-of-sense-makingV2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-19 Fri 14:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
---
layout: default
title: an org convert
---

<div id="outline-container-orga47d9fb" class="outline-2">
<h2 id="f06991dc-cc77-4b1b-b7bb-403159a60d23">Making Sense of Sense-Making</h2>
<div class="outline-text-2" id="text-f06991dc-cc77-4b1b-b7bb-403159a60d23">
<p>
September, 2020
</p>

<p>
&#x2014;
</p>

<p>
How intelligent systems learn rich representations that exploit
structure in the world to solve adaptive challenges is the major
question of intelligence. How and why does intelligence emerge in
complex adaptive systems? How can we build systems endowed with similar
representational infrastructure for understanding the world and acting
well in it?
</p>

<p>
Here I begin building an intuitive perspective for understanding how
adaptive systems gain meaningful knowledge of the world which supports
intelligent behavior. My interest is in the emergence of meaning that
leads to intelligent behaviors for adaptive systems, in contrast to a
survey of the specific cognitive mechanisms supporting human
intelligence. I want to develop some tools for thinking about the
evolutionary learning process that developed such complex systems as the
human mind. Below I aim to motivate the importance of the subjective and
action-oriented nature of natural intelligence for understanding the
search and learning process (evolution) that produced general
intelligence on Earth.
</p>

<p>
&#x2014;
</p>
</div>
</div>

<div id="outline-container-org2a68dbc" class="outline-2">
<h2 id="org2a68dbc">TOC</h2>
<div class="outline-text-2" id="text-org2a68dbc">
<ul class="org-ul">
<li><a href="#f06991dc-cc77-4b1b-b7bb-403159a60d23">Making Sense of Sense-Making</a></li>
<li><a href="#7df31510-0f49-4af6-b1d9-eac9dc11d5f9">1. Adaptive systems are subjective and action-oriented</a>
<ul class="org-ul">
<li><a href="#70e4f2de-b2c8-4eaa-86f0-6b931f4475af">1.1. intelligence is about exploiting emergent structure</a></li>
<li><a href="#70171a53-1287-4799-a889-6f1fda70caa9">1.2. roadmap</a></li>
</ul></li>
<li><a href="#c0179262-aec1-4752-9d15-b06cf0b91110">2. The appearance of a world</a>
<ul class="org-ul">
<li><a href="#3682a5e0-ba81-4e5b-b19b-4f9b986d0825">2.1. cognitive architecture defines subjective frame</a></li>
<li><a href="#ee07b1d1-116b-4065-b7a6-e16ce735e7c0">2.2. phenomenal contingencies</a></li>
<li><a href="#c7128fe1-3ea9-4efc-8593-1c8cdb2556c0">2.3. meaning emerges within subjective world structure</a></li>
</ul></li>
<li><a href="#f8968013-0b75-4f76-9706-5b9e2d7dd5fa">3. Umwelt</a>
<ul class="org-ul">
<li><a href="#49276fa3-52d4-488b-ad83-0a9f266596f3">3.1. the subjective perspective of living systems is crucial</a></li>
<li><a href="#a9a326d8-90a1-49a5-9743-edd103ae0604">3.3. subjective and action-oriented sense-making</a></li>
</ul></li>
<li><a href="#6bfcc610-4007-4e8a-a94b-7b50e9ccface">4. Exploiting structure</a>
<ul class="org-ul">
<li><a href="#37e86f18-c8af-4e6b-8fe4-98dfdc16d982">4.1. using world knowledge to do work</a></li>
<li><a href="#975876d0-98f0-4fc1-b452-60c9fd8e5b2f">4.2. biology exploits physics and creates complexity</a></li>
<li><a href="#fdac96ee-90d8-4c99-a18d-59dd91a191eb">4.3. adaptive transitions in information processing</a></li>
<li><a href="#8abffc00-e93e-4200-9c9d-e7dfc351c69e">4.4. adaptations exploit accessible structure</a></li>
</ul></li>
<li><a href="#e8f844b8-6f88-429d-b01b-d80b62ab7b38">5. Affordances</a>
<ul class="org-ul">
<li><a href="#ada10dc0-0167-4532-b9db-d66a99311de0">5.1. perceiving possibilities</a></li>
<li><a href="#a2a6b51a-f77e-4bd6-b1b3-93421722b480">5.2. expanding the concept of affordances</a></li>
<li><a href="#a9083dd2-5f95-4c5d-893d-ac7830de4580">5.3. exploring evolutionary affordances</a></li>
<li><a href="#7dc72e1a-58d1-43c7-92f5-a1022ab69c43">5.4. situated action-oriented agents</a></li>
</ul></li>
<li><a href="#aae54fe2-ab83-4659-92fa-9ea869b5c0e1">6. Adaptive world models</a>
<ul class="org-ul">
<li><a href="#b721181f-9f97-4414-90ce-72a90a07a1cf">6.1. converging adaptive representational concepts</a></li>
<li><a href="#cff73187-aa6f-4aa9-8b93-c866974a87de">6.2. life without objects?</a></li>
<li><a href="#2995116a-aa64-4966-9397-a1de38dad051">6.3. representational scaffolding</a></li>
</ul></li>
<li><a href="#b4511a0b-1a9a-49a7-87f0-ab9068225788">7. Wrapping up</a></li>
</ul>
</div>

<div id="outline-container-orge38364b" class="outline-3">
<h3 id="7df31510-0f49-4af6-b1d9-eac9dc11d5f9">1. Adaptive systems are subjective and action-oriented</h3>
<div class="outline-text-3" id="text-7df31510-0f49-4af6-b1d9-eac9dc11d5f9">
<p>
Thinking about how and why intelligence emerges forces us to be in touch
with the sole existence proof of general intelligence provided to us by
nature. This proof reveals to us that natural intelligence is about
processing information about the world to guide adaptive behavior. This
simple framing has important consequences. Studying natural intelligence
puts subjectivity and action-in-the-world center stage and demands we
try and piece together the conditions within which new forms of
sense-making emerge. Living systems have a point of view on the world,
and evolution learned to represent such phenomena as chemical gradients,
intuitive physics, and social dynamics for the purpose of producing
adaptive behavior to support this point of view. How?
</p>
</div>

<div id="outline-container-org7dffaba" class="outline-4">
<h4 id="70e4f2de-b2c8-4eaa-86f0-6b931f4475af">1.1. intelligence is about exploiting emergent structure</h4>
<div class="outline-text-4" id="text-70e4f2de-b2c8-4eaa-86f0-6b931f4475af">
<p>
In the big picture what I'm interested in is a story which describes the
evolution of intelligence through transitions in information processing
and cycles of creating and exploiting emergent structure in the world;
the richer and more abstract the information about the world a cognitive
system is able to exploit, the wider its ability to impact the world and
solve complex problems. I perceive this project of describing the
relationship between living systems and emergent structure as filling in
the space between physics and phenomenology. The story of intelligence.
This is a grandiose picture, but my weakness for philosophy and big
picture conceptual framings mandates I define the project as such.
</p>
</div>
</div>

<div id="outline-container-org0e87598" class="outline-4">
<h4 id="70171a53-1287-4799-a889-6f1fda70caa9">1.2. roadmap</h4>
<div class="outline-text-4" id="text-70171a53-1287-4799-a889-6f1fda70caa9">
<p>
Below I begin contextualizing how natural intelligence is fundamentally
situated in the world and the product of subjective sense-making
evolution developed in service of guiding adaptive behavior. In the
first section I begin to frame the problem of intelligence from the
subjective perspective and illuminate how cognitive systems are
subjective world models. In the second section I introduce Jakob von
Uexküll's Umwelt theory to further illustrate the subjective perspective
of living systems. In the third section I explicate what it means for
cognitive systems to "exploit structure in the world". In the fourth
section I introduce James Gibson's theory of affordances as a
theoretical concept to help conceptualize subjectively perceived
structure and the reciprocity defining the relationship between
cognitive systems and the world. In the fifth section I discuss the
representational scaffolding and flexibility underlying human
intelligence. At the end I will briefly review the discussion and
restate the subjective nature of the world models built by evolution and
their adaptive purpose.
</p>
</div>
</div>
</div>
