org/_thoughts/2020-09-23-making-sense-of-sense-makingV2.html

<div id="outline-container-org92834a6" class="outline-3">
<h3 id="c0179262-aec1-4752-9d15-b06cf0b91110">2. The appearance of a world</h3>
<div class="outline-text-3" id="text-c0179262-aec1-4752-9d15-b06cf0b91110">
<p>
Cognitive systems each possess a particular perspective on the world
which is defined by the network of information processing governing its
interaction with the world. For all of us there is a subjective world
that appears at each moment of our existence. Our brains and bodies
continually conspire with the environment in building the world that
appears to us. This cognitive handiwork simply is the world for us,
reflecting all the information about the world that has meaning to us.
The colors I see, the sounds I hear, the emotions I feel, my entire
psychological sense of self - everything - manifests from the
interaction between my cognitive architecture and the outside world.
Take away one of my cone types and my world is different. Take away my
ability to perceive the mental states of others and my world is
different. Give me language when I have none and my world is different.
</p>
</div>

<div id="outline-container-org5050ed0" class="outline-4">
<h4 id="3682a5e0-ba81-4e5b-b19b-4f9b986d0825">2.1. cognitive architecture defines subjective frame</h4>
<div class="outline-text-4" id="text-3682a5e0-ba81-4e5b-b19b-4f9b986d0825">
<p>
The subjective world is an amalgamation of features of the outside world
that have been captured and integrated into a perspective on the world,
the output of a world model engaged in a dance of interpretation and
action with the external world. The point here is that the world in
experience - from a cognitive system's perspective - is defined by the
particular means the system possesses for capturing and processing
information about the world. What we know about the world and how we act
flows from our sense-making capabilities and the structure we can
perceive in the world.
</p>
</div>
</div>

<div id="outline-container-orgb252d4d" class="outline-4">
<h4 id="ee07b1d1-116b-4065-b7a6-e16ce735e7c0">2.2. phenomenal contingencies</h4>
<div class="outline-text-4" id="text-ee07b1d1-116b-4065-b7a6-e16ce735e7c0">
<p>
I want to emphasize that despite it being trivially true that our
subjective frame follows from our physical organization, it is difficult
to really internalize the contingent character of the familiar
phenomenological tropes that format our own subjective worlds. Such
internalization helps us see the world from different perspectives and
appreciate the power and purpose of different representational features
and environmental engagements. Our subjective worlds could be different,
and are very different from organisms like apes, fish, and ants. The
single physical world we all exist within supports countless world
models; humans collectively occupy only a small area in the space of all
possible minds. However, even within this narrow band there is a wide
space of possibilities. One can read the amazing and sometimes tragic
literature of abnormal psychology to gain a deeper appreciation for the
ways in which our subjective realities could be different given
adjustments to our cognitive architectures.
</p>
</div>
</div>

<div id="outline-container-org4ccb820" class="outline-4">
<h4 id="c7128fe1-3ea9-4efc-8593-1c8cdb2556c0">2.3. meaning emerges within subjective world structure</h4>
<div class="outline-text-4" id="text-c7128fe1-3ea9-4efc-8593-1c8cdb2556c0">
<p>
So why focus on the subjective perspective of cognitive systems at all?
Because it is the structure of a cognitive systems subjective world
which entirely reflects its knowledge of the outside world, ability to
integrate new information, and horizon of possible actions. Subjective
meaning is the fuel for intelligence as a system can only act in
response to signals that have meaning for it. If we want to understand
how adaptive systems learn to make sense of the world then we must be
able to discuss the content of this sense-making, the world from the
system's perspective - the subjective world. The sense of subjectivity
we care about here is in the relationship between a system and the
world, consciousness not required. What matters are the dynamics between
an adaptive system and the environment, dynamics that can be described
for dogs, plants, and viruses. For humans this relationship is colored
in vivid conscious experience, and I started with this picture because
it is familiar, but we can just as well consider the structure of the
world from the perspective of a single cell or other basic forms of
life.
</p>
</div>
</div>
</div>

<div id="outline-container-orge1b8225" class="outline-3">
<h3 id="f8968013-0b75-4f76-9706-5b9e2d7dd5fa">3. Umwelt</h3>
<div class="outline-text-3" id="text-f8968013-0b75-4f76-9706-5b9e2d7dd5fa">
<p>
All of this so far is concisely conveyed in Jakob von Uexküll's Umwelt
theory from his work in biology and semiotics in the early 20th century.
In brief, biosemiotics is the study of signs and meaning in biological
systems. An early pioneer in the field, von Uexküll was interested in
understanding meaning-making and how living systems interpret their
world so as to enable appropriate behavior. He advocated for conceiving
of living systems as subjects first and foremost, in contrast to
traditional reductive approaches in biology.
</p>
</div>

<div id="outline-container-orgbc4dbd1" class="outline-4">
<h4 id="49276fa3-52d4-488b-ad83-0a9f266596f3">3.1. the subjective perspective of living systems is crucial</h4>
<div class="outline-text-4" id="text-49276fa3-52d4-488b-ad83-0a9f266596f3">
<p>
To begin formalizing the study of animals' subjective worlds, von
Uexküll used the term umwelt ("environment") to describe the world as it
is interpreted by an organism. The umwelt is the perceived world <i>within
which a subject acts</i>. It encapsulates all the features of the external
world that carry significance to the organism given it's sense-making
resources and functional entanglement with the environment. The umwelt
is complemented by the umgebung which describes the full external
reality.
</p>

<p>
<b>*</b> 3.2. environment as fundamental part of situated agents' intelligence
</p>
<p>
:ID:       2eeb586c-d803-4c46-8dff-071abeab61b0
</p>
<p>
In addition to championing the subjective nature of living systems, Umwelt theory also emphasizes the role of the environment in cognition.
If we do not appreciate the peculiar ways cognitive systems' relate to
their environments then we cannot understand the extent of their
abilities and intelligence. We shouldn't study fish out of water nor
birds in cages, these artificial environments being far removed from the
environmental niches in which they are built to act well in. The
environment is a crucial partner in the evolution of adaptive behavior.
Adaptive systems do not learn high fidelity representations of the world
for their own sake, but instead learn representations and habits that
guide effective behavior <i>in their local environments</i>. This recognition
of the importance of the environment sets the table nicely for further
exploration of distributed intelligence and theories that <a href="https://www.nyu.edu/gsas/dept/philo/courses/concepts/clark.html">extend cognition</a> 
beyond the narrow confines of the skull.
</p>
</div>
</div>

<div id="outline-container-orgf5b12b2" class="outline-4">
<h4 id="a9a326d8-90a1-49a5-9743-edd103ae0604">3.3. subjective and action-oriented sense-making</h4>
<div class="outline-text-4" id="text-a9a326d8-90a1-49a5-9743-edd103ae0604">
<p>
What we get here is a framing of adaptive behavior that focuses on the
subjective sense-making of living systems and their distinctive
entanglements with the environment. These entanglements are feedback
loops relating meaningful features of the world to possible actions. The
umwelt isolates all the information a creature can interact with. It
describes a world model, and highlights the subjective and
action-oriented nature of biological intelligence. These are nice
footholds when considering how adaptive systems learn rich models of the
world.
</p>
</div>
</div>
</div>
