org/_thoughts/2020-09-23-making-sense-of-sense-makingV2.html

<div id="outline-container-org95d0d02" class="outline-3">
<h3 id="6bfcc610-4007-4e8a-a94b-7b50e9ccface">4. Exploiting structure</h3>
<div class="outline-text-3" id="text-6bfcc610-4007-4e8a-a94b-7b50e9ccface">
<p>
Let's bring this all back directly to the emergence of intelligence and
clarify what it means to exploit structure in the world. To first recap,
the connection to intelligence here is that evolution built world models
that are able to represent and exploit abstract domains of information
in the world. These world models are fundamentally situated in world,
engaging their environments with specific cognitive tools to exploit
particular patterns of information to enable adaptive behavior. Each
organisms' umwelt is structured by information evolution has identified
as useful to process and transform in guiding adaptive behavior. What an
organism can do with the information it has access to defines its
intelligence. What we want to understand is how adaptive systems learn
to make sense of, and exploit, different forms of structure in the
world.
</p>
</div>

<div id="outline-container-org7c3b846" class="outline-4">
<h4 id="37e86f18-c8af-4e6b-8fe4-98dfdc16d982">4.1. using world knowledge to do work</h4>
<div class="outline-text-4" id="text-37e86f18-c8af-4e6b-8fe4-98dfdc16d982">
<p>
But what does it actually mean to "exploit structure" as I've been
causally saying? The phrase is shorthand for "capture some information
about the world, process it, and take advantage of it in continued
engagement with the world". Exploiting structure entails using some
gained knowledge about the real world to achieve some end. I have
loosely used the phrase to describe individuals acting in the world as
well as learning that occurs across generations. For example, a simple
prokaryote exploits information about its surrounding chemical gradient
in navigating the world; in fact, the chemical gradient exhausts the
information about the world it is able to exploit. On the other end of
the spectrum are humans, whose evolutionary inheritance is a genetic
code within which evolution has compressed an immense amount of
information about the world into. The result of this genetic compression
of information about the world is that we are built to exploit tons of
structure in the world, have rich ways of understanding the world, and
are thus pretty intelligent systems.
</p>
</div>
</div>

<div id="outline-container-orgc7a8fa2" class="outline-4">
<h4 id="975876d0-98f0-4fc1-b452-60c9fd8e5b2f">4.2. biology exploits physics and creates complexity</h4>
<div class="outline-text-4" id="text-975876d0-98f0-4fc1-b452-60c9fd8e5b2f">
<p>
By exploiting the structure of physics, biology creates emergent levels
of structure and complexity. The dynamics governing mechanical physics
at the biological level allow for objects with particular shapes and
characteristics to capture, process, and integrate specific information
about the world. The building blocks of biological life are able to
store and direct energy using movement patterns that exploit the
dynamics of the mechanical force. The state of these objects relates to
the real world and this information can be used to do different types of
work. Shapes that persist through time and direct energy in useful ways
can evolve. As these basic self-organizing systems evolve, the range of
possible collective computations grows, allowing for more complex
organization and new functional engagements with the real world.
</p>
</div>
</div>

<div id="outline-container-orgac9d6f7" class="outline-4">
<h4 id="fdac96ee-90d8-4c99-a18d-59dd91a191eb">4.3. adaptive transitions in information processing</h4>
<div class="outline-text-4" id="text-fdac96ee-90d8-4c99-a18d-59dd91a191eb">
<p>
In building world models to process and exploit structure in the world,
evolution discovered ways of capturing and using information about the
world that are particularly helpful for guiding adaptive behavior.
Chemical-sensing, epigenetics, nervous systems, linguistic
communication - these are all major transitions in information
processing that fueled adaptive success for their implementers by
broadening their horizons of perception and action. More complex world
models make use of information that was previously lost to noise to do
causal work on behalf of the subject perceiving the world. As evolution
naively explores possibilities affordances (ADD LINK BACK IN HERE) and
innovates in response to adaptive challenges, opportunities for
increased complexity and intelligence appear.
</p>
</div>
</div>

<div id="outline-container-orgccfbb27" class="outline-4">
<h4 id="8abffc00-e93e-4200-9c9d-e7dfc351c69e">4.4. adaptations exploit accessible structure</h4>
<div class="outline-text-4" id="text-8abffc00-e93e-4200-9c9d-e7dfc351c69e">
<p>
Keep in mind the subjective frame here as sense-making serves a
subjective perspective and all adaptations necessarily exploit some
<i>accessible</i> structure in the world to enable productive behaviors. The
exploited structure could be at the level of fundamental physics,
chemical gradients, or social dynamics. The simplest illustration of
this is the above example of the emergent mechanics of basic biological
structures. Trivially, all living systems exploit the laws of physics to
maintain themselves. However, this framing is just as useful in
describing complex systems exploiting higher-level domains to accomplish
goals. Higher-level structure plays a similar role in framing an agent's
world as the mechanical force does for simple biological objects.
Although, the dynamics between physical systems and emergent
higher-levels of structure are more opaque. Next I'll introduce the
concept of affordances to help us better frame a cognitive systems
relation to the world.
</p>
</div>
</div>
</div>

<div id="outline-container-orge9e2a03" class="outline-3">
<h3 id="e8f844b8-6f88-429d-b01b-d80b62ab7b38">5. Affordances</h3>
<div class="outline-text-3" id="text-e8f844b8-6f88-429d-b01b-d80b62ab7b38">
<p>
We need more theoretical tools to help describe the relationship between
cognitive systems and the environment. The concept of affordances
developed by James Gibson in the third quarter of the 20th century is
one such tool. Gibson was an ecological psychologist studying visual
perception interested in how organisms see the world. He developed the
theory of affordances to expand the vocabulary we have for thinking
about perception, action, and the reciprocity between organisms and
their environments. In <a href="https://archive.org/details/pdfy-u5hmFOvOM2Civ4Gz/mode/2up">Gibson's own words</a> "the affordances of the environment are
what it offers the animal, what it provides or furnishes, either for
good or ill". The upshot of affordances is the beginning of a theory of
the perception of meaning for living systems that emphasizes subjective
sense-making and action-oriented engagement with the world.
</p>
</div>
