org/_thoughts/2020-09-23-making-sense-of-sense-makingV2.org
*** 5.1. perceiving possibilities
    :PROPERTIES:
    :ID:       fcaed959-4ed7-4adf-8db1-1a92bc5914f7
    :CUSTOM_ID: ada10dc0-0167-4532-b9db-d66a99311de0
    :END:
So what's an affordance? The term has been adopted and used by different
communities in varying ways, particularly in the field of human-computer
interfaces and in design generally. At their core, affordances are an
abstract category of behavioral opportunities defined by the
possibilities an environment offers to a particular agent. For most
humans a chair affords sitting, a pencil affords writing, and wood
affords fire building. For an ant these three affordances do not exist.
Affordances manifest at the intersection of a cognitive system's action
dispositions given its internal constitution and the reality of the
environment the system inhabits. Affordances describe a domain of
structure in the world from a subjective perspective, and really in a
sense capture /the/ structure of the world for a particular cognitive
system. To perceive an affordance is to perceive a possibility. There
are traces of von Uexküll's ideas here in the agent relative status of
affordances and the focus on action-oriented engagement with
environmental niches; the umwelt is colored by affordances.

*** 5.2. expanding the concept of affordances
    :PROPERTIES:
    :ID:       120263c2-d89a-4b93-8615-538c7821e9c4
    :CUSTOM_ID: a2a6b51a-f77e-4bd6-b1b3-93421722b480
    :END:
Perhaps in contrast to strict Gibsonians, I prefer a wider notion of
affordances that extends above and below the level of single organism of
cat or human for which we usually reserve the term perception. I find
the extended concept to be a useful companion in considering how
adaptive systems evolve in relation to the structure of the world
generally. From a system's subjective perspective the world always
offers a particular suite of possibilities, and this is as true for
simple biological objects as for an entire organism. Zooming out over
longer time scales we can consider evolutionary affordances, the
possible evolutionary paths, present for particular physical systems in
certain environmental niches.

*** 5.3. exploring evolutionary affordances
    :PROPERTIES:
    :ID:       4a73aabb-8d69-4990-9697-eee1a5e1e023
    :CUSTOM_ID: a9083dd2-5f95-4c5d-893d-ac7830de4580
    :END:
Because the set of all possible affordances for a system entirely
reflects how a system perceives and can interact with the world, the
solution space for an adaptive problem is necessarily a subset of a
system's set of possible affordances. Over time, adaptive systems learn
to exploit, by internalizing, the structure upon which evolutionarily
rewarding affordances rest - the result being a more adaptive set of
affordances. This internalization describes developments from the
physical organization cells and nervous systems take on, to the
emergence of social cooperation among humans. A clear example are the
visual priors that visual systems learn which mirror the statistics of
the surrounding visual world. This is why the many visual illusions we
see today are built with patterns and compositions that are rare, if at
all present, in the natural world. Adaptions reflect learned world
knowledge. As systems adapt and expand their world models to exploit
accessible domains of structure in the world such as chemical, visual,
or social information, they create new representations and affordances.
Evolution is an effective, although inefficient, search mechanism for
learning about the structure of the world.

*** 5.4. situated action-oriented agents
    :PROPERTIES:
    :ID:       18b2079d-5416-4195-bec2-0fde319eba8f
    :CUSTOM_ID: 7dc72e1a-58d1-43c7-92f5-a1022ab69c43
    :END:
If we return to the general notion of affordances as the possible
actions offered by the environment to an agent, we see that affordances
also clearly emphasize the situated nature of cognitive systems.
Affordance theory tells us we perceive things in relation to the
possibilities they present for action, which themselves describe the
coupled dynamics between an agent and the environment; natural
intelligence is fundamentally situated in the world. By giving us a way
to conceive of the subjective meaning of a signal to a cognitive system,
affordances are a powerful concept that is useful for a wide variety of
questions about cognition and intelligence.

** 6. Adaptive world models
   :PROPERTIES:
    :ID:       67de7625-cedb-4fc6-934c-08c9266b4ac8
    :CUSTOM_ID: aae54fe2-ab83-4659-92fa-9ea869b5c0e1
   :END:
Over time evolution learned about more and more structure in the world
as it naively explored affordances and the space of possible minds. This
discovered structure was built into the world models of increasingly
intelligent systems like ourselves, and manifests in our subjective
realities through phenomena like embodiment, memory, and our deep -
seemingly persistent - psychological sense of self. Our cognitive
architectures interpret the world in ways that produce the familiar
phenomenological tropes we have for understanding the world. Humans
possess wider means of understanding the world than other systems, our
subjective worlds are richer, and a great diversity of information in
the world carries meaning for us. Our cognitive flexibility and learning
ability creates open-ended affordances conditioned on different
experiential paths and cultural inheritances. However, this richness is
built atop representational scaffolding for making sense of the world
that we share in part with many other creatures.

*** 6.1. converging adaptive representational concepts
    :PROPERTIES:
    :ID:       30a14cf8-a456-41f1-9473-4b1c75dac15c
    :CUSTOM_ID: b721181f-9f97-4414-90ce-72a90a07a1cf
    :END:
The common representational concepts that define umwelt across the
biosphere are prominent because they pick out information about the
world that has proven effective for adaptive behavior. Over time these
useful ways of relating to the world were grooved into living systems.
Similar to how basic biological objects converge on certain shapes and
mechanics for doing work, cognitive systems on Earth converge on basic
representational constructs for understanding the world. Many of these
core representational concepts like embodiment, space, objects, and
intuitive physics frame our own subjective worlds and are so familiar
that they can be hard to appreciate as important components of
intelligence.

*** 6.2. life without objects?
    :PROPERTIES:
    :ID:       8640a366-cfa1-4eb8-9fd0-b1e9da322952
    :CUSTOM_ID: cff73187-aa6f-4aa9-8b93-c866974a87de
    :END:
For example, it is hard to imagine living without an intuitive concept
for something like the general category of object, a subjective world
where things like rocks and fire sit idle outside one's cognitive loops,
registering zero affordances. Instead, we are equipped to flexibly
integrate new information and emergent possibilities. When I encounter
new objects I already know a lot of information about them given the web
of world knowledge I already have. For example: I know they will fall
when dropped unless specifically designed otherwise, that sharp objects
may cut me, and that heavy objects are hard to move. These basic
intuitions betray a vast amount of world knowledge that is constantly
helping me navigate the world. Again, I recommend reading accounts from
abnormal psychology to develop an appreciation for the fragility of our
own familiar percepts and phenomenology.

