org/_thoughts/2020-09-23-making-sense-of-sense-makingV2.org
*** 6.3. representational scaffolding
    :PROPERTIES:
    :ID:       ca9311a8-4c4a-44af-97a0-cd394a861239
    :CUSTOM_ID: 2995116a-aa64-4966-9397-a1de38dad051
    :END:
We have been tuned to the world we live in by evolution. Our subjective
worlds are filled with structure and affordances that support our
behavior and the preservation of our informational integrity. The rich
representational scaffolding we have for making sense of the world forms
the stage upon which new and higher-level entities gain meaning. We
seamlessly find meaning in language, art, religion, social
relationships, mathematics, and culture generally because of the rich
forms of sense-making we inherited from evolution. Human intelligence is
so far unique on Earth, but the dynamics responsible for our
intelligence and meaning-making extend throughout all of evolution. In
trying to understand the development of the basic representational
concepts underlying our own general intelligence we should keep in mind
the subjective and action-oriented framework within which these
competencies emerged.

** 7. Wrapping up
   :PROPERTIES:
    :ID:       8df341d1-9d7d-4a45-b0c8-80fb0d0233ff
    :CUSTOM_ID: b4511a0b-1a9a-49a7-87f0-ab9068225788
   :END:
Intelligence is a hard problem. I think the more tools we have for
trying to understand how adaptive systems learn about the structure of
the world the more successful our inquiries into the emergence of
intelligence will be. I've tried here to relate the usefulness of
considering adaptive systems as fundamentally situated in the world and
of intelligence as the product of subjective sense-making. I introduced
the concepts of umwelt and affordances to help frame the discussion
about how living systems relate to the world and adapt to exploit the
structure of their niches. There are many loose ends here related to the
mechanisms of evolution, life, learning, representation, agency,
artificial intelligence and much more. I hope to continue exploring some
of these in the future!
